# Taps
tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "noahgorstein/tap"
tap "saulpw/vd"
tap "yqrashawn/goku"

# Packages
brew "ag"
brew "aider"
brew "asdf"
brew "autossh"
brew "bash"
brew "bat"
brew "bat-extras"
brew "broot"
brew "btop"
brew "calc"
brew "coreutils"
brew "datamash"
brew "dblab"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "dockerfmt"
brew "emacs-plus"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fpp"
brew "fswatch"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "gpg2"
brew "httpie"
brew "hub"
brew "icdiff"
brew "jq"
brew "noahgorstein/tap/jqp"
brew "jump"
brew "k9s"
brew "krew"
brew "lf"
brew "lsd"
brew "mdv"
brew "ncdu"
brew "nmap"
brew "nnn"
brew "openssh"
brew "pgcli"
brew "pipx"
brew "podman"
brew "podman-compose"
brew "podman-tui"
brew "pwgen"
brew "ranger"
brew "ripgrep"
brew "sc-im"
brew "starship"
brew "stern"
brew "superfile"
brew "tealdeer"
brew "teleport"
brew "telnet"
brew "terminal-notifier"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "vim"
brew "saulpw/vd/visidata"
brew "watch"
brew "z"
brew "zlib"
brew "zsh"
brew "yqrashawn/goku/goku"

# Casks
cask "alfred"
cask "betterzip"
cask "brave-browser"
cask "cursor"
cask "firefox"
cask "firefox@developer-edition"
cask "font-anonymous-pro"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-droidsansmono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-input"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-nerd-font-mono"
cask "font-iosevka-slab"
cask "font-jetbrains-mono"
cask "font-liberation-mono-for-powerline"
cask "font-liberation-sans"
cask "font-liberationmono-nerd-font"
cask "font-meslo-lg"
cask "font-monaspace"
cask "font-nixie-one"
cask "font-office-code-pro"
cask "font-pt-mono"
cask "font-raleway"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-victor-mono"
cask "gimp"
cask "hammerspoon"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "librewolf"
cask "lm-studio"
cask "mark-text"
cask "neohtop"
cask "ngrok"
cask "notunes"
cask "opensuperwhisper"
cask "podman-desktop"
cask "quicklook-csv"
cask "quicklook-json"
cask "rancher"
cask "setapp"
cask "suspicious-package"
cask "syncthing"
cask "utm"
cask "vlc"
cask "webpquicklook"
